#1
#1.1
n = "233242343"
print(n.isdigit())

#1.2
print(n.count(" "))

#1.3
point = "dfrgf.fgfb.."
print(point.count("."))

#1.4
st = "Homework"
print(st.center(100))

#1.5
st = "this is my homework"
print(st.title())

#1.6
st = "somethintyuyg"
print(st.find("ing"))
print(st.startswith("ing", len(st)-3))

#1.7
st = "nkueriajio"
print(st.find("a"))

#1.8
st = "lorem\nipsum\ngradum\n"
print(st.splitlines())
print("___________________________")
#доделать по символу пробела


#2
#2.1 Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 367 и 127
a, b = 367, 127
print("Длина гипотенузы: ")
print((a**2+b**2)**0.5)

#2.2 Дано двузначное число. Найдите число десятков в нем.
num = 67.78
print(int(num/10))
#деление нацело


#2.3 Дано трёхзначное число. Найдите сумму его цифр.
num = 543
num1 = int(num/100)
num2 = int((num - num1*100)/10)
num3 = (num - num1*100)%10
print(num1+num2+num3)

#второй вариант
n1 = num//100
n2 = (num%100)//10
n3 = (num%100)%10
print(n1+n2+n3)

#2.4 Дано целое число n. Выведите следующее за ним чётное число.
n = 43535
print(n+2-(n%2))

#2.5 Дано положительное действительное число X. Выведите его дробную часть.
x = 3456.6765
print(x%2)
#доделать


#2.6 Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.
x = 3456.6765
print(int(10*(x%2)))
print("--------------------------Списки")

#3
#3.1 Выведите 3-е с конца слово из списка.
lst = ["one", "two", "three", "world", "five"]
print(lst[-3])
#3.2 Выведите 1-ю букву второго слова из списка.
print(lst[1][0])
#3.3. Выведите последнюю букву последнего слова из списка.
print(lst[-1][-1])
#3.4. Добавьте в конец списка еще одно слово.
lst.append("six")
print(lst)
#3.5. Вставьте в середину списка еще одно слово.
lst.insert(((len(lst)) // 2), "middle")
print(lst)
#3.6. Удалите первое слово из списка.
lst.pop(0)
print(lst)
#3.7. Удалите слово «world» из списка, если оно есть в списке.
lst.remove("world")
print(lst)
#если слова world нет в списке


#4
#Создайте словарь характеристик продукта с ключами «title» (значение типа данных str),
# «price» (значение численного типа данных), «ingredients» (значение – список строк).
dist = {"title": "Cake", "price": 200, "ingredients": ["milk", "sugar", "egg"]}

#4.1. Добавьте еще одну пару ключ-значение - «description»: какой-то текст
dist["description"] = "How to make cake: top 10 tips for success"
#4.2. Увеличьте цену на 100.
dist["price"]+=100
#4.3. Добавьте в список ингредиентов еще один ингредиент.
dist["ingredients"].append("flour")
#4.4. Выделите на экран количество ингредиентов продукта.
print(len(dist["ingredients"]))
#4.5. Удалите из словаря значение с ключом «description»
dist.pop("description")
print(dist)

#5
# Воспользуйтесь одним print(), но при этом выводите с новой строки:
#     • Сначала выведите третий символ этой строки.
#     • Во второй строке выведите предпоследний символ этой строки.
#     • В третьей строке выведите первые пять символов этой строки.
#     • В четвертой строке выведите всю строку, кроме последних двух символов.
#     • В пятой строке выведите все символы с четными индексами (считая,
#     что индексация начинается с 0, поэтому символы выводятся, начиная с первого символа).
#     • В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
#     • В седьмой строке выведите все символы в обратном порядке.
#     • В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
#     • В девятой строке выведите все символы строки через один в обратном порядке, начиная с предпоследнего.
#     • В десятой строке выведите все символы в обратном порядке без первого и последнего элемента.
#     • Ну, и напоследок выведите длину данной строки.
#
# x = input("Введите строку: ")
# x_split = x[0:-1]
# x_split2 = x[1:-1]
# print(x[2],
#       x[-2],
#       x[0:5],
#       x[0:-2],
#       x[0::2],
#       x[1::2],
#       x[::-1],
#       x[::-2],
#       x_split[::-1],
#попробовать  сделать не двумя срезами
#       x_split2[::-1],
#       len(x),
#       sep="\n", end='\n')

#6 Пользователь вводит строку. Разрежьте её на две части – равные, если длина строки чётная,
#а если длина строки нечётная, то длина первой части должна быть на один символ больше.
#Переставьте эти две части местами, результат запишите в новую строку и выведите на экран.
#
# str_user = input("Введите строку: ")
# x = int(len(str_user))
# x2 = int(x/2)
# if int(len(str_user))%2==0:
#     str1 = str_user[0:x2]
#     str2 = str_user[x2:x]
#     print("Строка четная:")
# else:
#     x2+=1
#     str1 = str_user[0:x2]
#     str2 = str_user[x2:x]
#     print("Строка нечетная:")
# print(str2+str1)

#7
# Пользователь вводит целое число. Требуется определить, является ли год с данным номером
# високосным. Если год является високосным, то выведите YES, иначе выведите NO. Напомним,
# что в соответствии с григорианским календарём, год является високосным, если его номер кратен 4,
# но не кратен 100, а также если он кратен 400.

# year = int(input("Введите год чтобы определить, является ли он високосным : "))
# if year%4==0 and (year%100)!=0:
#     print("Yes")
# else:
#     print("No")

#8
# Даны три числа a, b, c. Определите, существует ли треугольник с такими сторонами. Если треугольник существует,
# выведите строку YES, иначе выведите строку NO.
# try:
#     a = float(input("Введите стороны треугольника. \n Сторона a ="))
# except ValueError:
#     print("Вы ввели не число")
#     a = float(input("Введите стороны треугольника. \n Сторона a ="))
# try:
#     b = float(input("Сторона b ="))
# except ValueError:
#     print("Вы ввели не число")
#     b = float(input("Сторона b ="))
# try:
#     c = float(input("Сторона c ="))
# except ValueError:
#     print("Вы ввели не число")
#     c = float(input("Сторона c ="))
# if a + b > c and a + c > b and b + c > a:
#     print("Yes")
# else:
#     print("No")

#9
# Дано три числа. Упорядочите их в порядке возрастания. Программа должна считывать три числа a,b,c, затем программа
# должна менять их значения так, чтобы стали выполнены условия a <= b <= c, затем программа выводит
# тройку a,b,c.
# Дополнительные ограничения: нельзя использовать дополнительные переменные.
# a, b, c = 1, 1, 2
# if a > b:
#     a, b = b, a
# if b > c:
#     b, c = c, b
# if a > b:
#     a, b = b, a
# print(a, b, c)


#10
# Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно из чисел:
# 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа
#
# flag = 0
# a, b, c = 1, 2, 1
#
# if a==b and b==c:
#    flag = 3
# elif b==c or c==a or a==b:
#     flag = 2
# print(flag)