import random
#1
# Воспользуйтесь одним print(), но при этом выводите с новой строки:
#     • Сначала выведите третий символ этой строки.
#     • Во второй строке выведите предпоследний символ этой строки.
#     • В третьей строке выведите первые пять символов этой строки.
#     • В четвертой строке выведите всю строку, кроме последних двух символов.
#     • В пятой строке выведите все символы с четными индексами (считая,
#     что индексация начинается с 0, поэтому символы выводятся, начиная с первого символа).
#     • В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
#     • В седьмой строке выведите все символы в обратном порядке.
#     • В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
#     • В девятой строке выведите все символы строки через один в обратном порядке, начиная с предпоследнего.
#     • В десятой строке выведите все символы в обратном порядке без первого и последнего элемента.
#     • Ну, и напоследок выведите длину данной строки.
#       Выловите исключения, если введённая строка слишком короткая. Какого типа исключение
# надо выловить?
# x = input("Введите строку: ")
# x_split = x[0:-1]
# x_split2 = x[1:-1]
# print(x[2],
#       x[-2],
#       x[0:5],
#       x[0:-2],
#       x[0::2],
#       x[1::2],
#       x[::-1],
#       x[::-2],
#       x_split[::-1],
#       x_split2[::-1],
#       len(x),
#       sep="\n", end='\n')

#2 Пользователь вводит строку. Разрежьте её на две части – равные, если длина строки чётная,
#а если длина строки нечётная, то длина первой части должна быть на один символ больше.
#Переставьте эти две части местами, результат запишите в новую строку и выведите на экран.
#
# str_user = input("Введите строку: ")
# x = int(len(str_user))
# x2 = int(x/2)
# if int(len(str_user))%2==0:
#     str1 = str_user[0:x2]
#     str2 = str_user[x2:x]
#     print("Строка четная:")
# else:
#     x2+=1
#     str1 = str_user[0:x2]
#     str2 = str_user[x2:x]
#     print("Строка нечетная:")
# print(str2+str1)

#Задание 3
# Пользователь вводит целое число. Требуется определить, является ли год с данным номером
# високосным. Если год является високосным, то выведите YES, иначе выведите NO. Напомним,
# что в соответствии с григорианским календарём, год является високосным, если его номер кратен 4,
# но не кратен 100, а также если он кратен 400.

# year = int(input("Введите год чтобы определить, является ли он високосным : "))
# if year%4==0 and (year%100)!=0:
#     print("Yes")
# else:
#     print("No")

#Задание 4
# Даны три числа a, b, c. Определите, существует ли треугольник с такими сторонами. Если треугольник существует,
# выведите строку YES, иначе выведите строку NO.
# try:
#     a = float(input("Введите стороны треугольника. \n Сторона a ="))
# except ValueError:
#     print("Вы ввели не число")
#     a = float(input("Введите стороны треугольника. \n Сторона a ="))
# try:
#     b = float(input("Сторона b ="))
# except ValueError:
#     print("Вы ввели не число")
#     b = float(input("Сторона b ="))
# try:
#     c = float(input("Сторона c ="))
# except ValueError:
#     print("Вы ввели не число")
#     c = float(input("Сторона c ="))
# if a + b > c and a + c > b and b + c > a:
#     print("Yes")
# else:
#     print("No")

# Задание 5
# Дано три числа. Упорядочите их в порядке возрастания. Программа должна считывать три числа a,b,c, затем программа
# должна менять их значения так, чтобы стали выполнены условия a <= b <= c, затем программа выводит
# тройку a,b,c.
# Дополнительные ограничения: нельзя использовать дополнительные переменные.
# a, b, c = 1, 1, 2
# if a > b:
#     a, b = b, a
# if b > c:
#     b, c = c, b
# if a > b:
#     a, b = b, a
# print(a, b, c)


# Задание 6
# Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно из чисел:
# 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа
#
# flag = 0
# a, b, c = 1, 2, 1
#
# if a==b and b==c:
#    flag = 3
# elif b==c or c==a or a==b:
#     flag = 2
# print(flag)


# Задание 7
#     1) Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.
#     2) Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1. Попробуйте вывести числа в
# одной строчке, разделённые пробелом
#     3) Напишите цикл while, в котором вы, если число чётное, каждую итерацию уменьшаете его в 2 раза. Вы делите
# целое чётное число на 2 пока от него не останется нечётный остаток. Посчитайте сколько раз вы делили нацело на 2.
#7.1
# i = 0
# while i <= 20:
#     print(i, end=" ")
#     i+= 1
# print("\n")
#
# #7.2
# i = 20
# while i >= 1:
#     print(i, end=" ")
#     i-= 1
# print("\n")
#
# #7.3
# flag = 0
# i = int(input("Введите число: "))
# if i!=0:
#     while True:
#         if i%2==0:
#            i*=0.5
#            flag+=1
#            print(int(i), end=" ")
#            if i%2!=0:
#              break
#         else:
#             print("Число нечетное!")
#             break
#     print("Число поделили: ", flag, " раз")
# else:
#     print("Вы ввели некорректное число")

# Задание 8
# У вас есть список чисел.
#     1. Напишите цикл, который выводит на экран и удаляет с начала элементы списка, пока он не останется пустым
#     2. ** Как сделать это же задание со строкой: напишите цикл, который выводит на экран и «удаляет» первый символ
# строки, пока она не станет пустой?
#     3. Напишите цикл, который выводит на экран и удаляет элементы списка от самого маленького до самого большого,
# пока он не останется пустым.
#     4. ** Дана последовательность натуральных ненулевых чисел, завершающаяся числом 0. Определите, какое
# наибольшее число подряд идущих элементов этой последовательности равны друг другу.

#8.1
# lst= [3,4,67,65,12,8,45,907,5]
# while lst:
#     print(lst, end="\n")
#     lst.pop(0)

#8.2
# st = "something"
# # list=[]
# # for i in str:
# #     list.append(i)
# for i in range(len(st)):
#     print(st[i:])

#8.3
# list = [3,4,67,65,1200,45,54465,1,-3]
# i=0
# #for i in range(len(list) - 1):
# while i < len(list)-1:
#     m = i
#     j = i + 1
#     while j < len(list):
#         if list[j] < list[m]:
#             print("отловили меньший")
#             m = j
#         j = j + 1
#     list[i], list[m] = list[m], list[i]
#     print(list[i], " заменили на",list[m])
#     i+=1
# print(list, end=" ")
# print("---------------------------------------------\n")

# li = [56, 5, 15, 4, 9, 3,800,22, 11]
# n = len(li)
# for i in range(0,n-1):
#     for j in range(0,n-i-1):
#         if li[j] > li[j+1]:
#             li[j],li[j + 1] = li[j + 1], li[j]
#
# while li:
#     print(li.pop(0))


#8.3
# li = [56, 5, 15, 4, 9, 3, 800, 22, 11]
# while li:
#   minimum=li.index(min(li))
#   #print(li.pop(minimum), " ")
#   li.remove(min(li))
#   print(li)

#8.4
# li=[]
# for x in range(10, 300, 20):
#     li.append(random.randint(1,5)*x)
# #li=[30, 350, 100, 443, 150, 445, 440, 750, 510, 370, 390, 280, 1150, 281, 281]
# di ={}
# maximum= 0
# iter=0
# outp={}
# for i in li:
#     di[i] =li.count(i)
#     if li.count(i)>1:
#         maximum=li.count(i)
# for key in di:
#     if di[key] == maximum:
#         outp[key]=maximum
#         iter+=1
# if iter==1:
#     print("Количество повторяющихся значений", maximum)
#     for i in outp:
#         print("Числа",i)
# elif iter>1:
#     print("В последовательности находится больше одного ряда повторяющихся значений:", sep=" ")
#     for i in outp:
#         print("Число ", i, "повторяются одинаковое количество раз=",outp[i])
# else:
#     print("Числа в последовательности не повторяются!")

# Задание 9
# Пишем программу, которая попросит пользователя ввести слово (строка без пробелов в середине, а вначале и в
# конце пробелы могут быть). Пока он не введёт правильно, просите его ввести.
# while True:
#     user_str = input("Введите строку без пробелов: ").strip()
#     if user_str.count(" ") == 0:
#         break
# print("Наконец-то: ", user_str)


# flag=0
# number = 56
# while number%2==0:
#     number=number/2
#     print(number)
#     flag+=1
# print("количество делений: ",flag)

# l = [2,5,65,8,56,32,4]
# for item in l:
#     if item %2==0:
#         print(item)
#     elif item %2==1:
#         print(item+1)
#     else:
#         print(item, "is not an integer!")

# for item in l:
#     if item %2==1:
#        l[l.index(item)]+=1
# print(l)

# Задание 10 *
# Создайте строку, в которой написан, какой-то текст. Пример:
# We are not what we should be!
# We are not what we need to be.
# But at least we are not what we used to be
#  (Football Coach)
#     • Посчитайте сколько слов в тексте (разбейте на слова методом строк split)
#     • Удалите знаки препинания в списке слов (пройдитесь циклом все слова и удалите методом strip знаки
#     препинания)
#     • Выведите слова в алфавитном порядке (найдите метод списка, который сортирует)
# Усложнённое ** (можно сначала его не делать):
#     • Посчитать, сколько раз встречается каждое слово.
# (Подсказка: создавать словарь, где ключи — это слова из текста, а в значениях подсчитываем количество
# «встречаний» этого слова)
#     • Слова с большой буквы и с маленькой это все равно одно и тоже слово

default_folder = "We are not what we should be!\n We are not what we need to be.\n But at least we are not what we used to be\n (Football Coach)"
folder = input("Введите строку: ") or default_folder
f=folder.split(" ")
print(len(f))
punctuation=[",",".","!","?",";",":","\n","(",")"]
for i in punctuation:
    folder = folder.replace(i,"").lower()
fol=folder.split(" ")
print(sorted(fol))
dist_folder={}
for i in fol:
    dist_folder[i]=fol.count(i)
print(dist_folder)